Documents/РегистрацияИнвестиционногоПрофиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияИнвестиционногоПрофиля</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИнвестиционныеПрофили</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубъектУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвестиционнаяЦель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвеcтиционныеЦели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеОпытаИЗнанийВОбластиИнвестирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПередаваемыхВДУСредств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеличинаУсловногоДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеличинаУсловногоРасхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеличинаУсловныхНакоплений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемлемыйУровеньРискаВОтносительномВыражении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантИнвестиционногоГоризонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИнвестиционногоГоризонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаИнвестиционногоГоризонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериодаИнвестиционногоГоризонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтносительныйСрокИнвестиционногоГоризонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельныйДопустимыйРискЗаВесьСрокИнвестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЦелевыхСредств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотношениеЧистыхАктивовКОбъемуПередаваемыхСредств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеСпециалистовИлиПодразделенияИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеОперацийСФИЗаПоследнийОтчетныйГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйИнвестиционныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиАкционерныхИнвестиционныхФондов</Name>
					<Comment>Управление активами АИФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПаевогоИнвестиционногоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФОГФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеИмуществомСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиНакоплениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиРезервами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеРезервамиСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеСобственнымиСредствамиПенсионныхФондов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЦелевыхКапиталов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РегистрацияИнвестиционногоПрофиля/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВариантИнвестиционногоГоризонтаПриИзменении(Элемент)
	
	Если Объект.ВариантИнвестиционногоГоризонта = ПредопределенноеЗначение("Перечисление.ВариантыИнвестиционногоГоризонта.ИнтервалДат") Тогда
		Объект.ОтносительныйСрокИнвестиционногоГоризонта = Неопределено;
	Иначе
		Объект.НачалоПериодаИнвестиционногоГоризонта	= Неопределено;
		Объект.ОкончаниеПериодаИнвестиционногоГоризонта	= Неопределено;
	КонецЕсли;
	
	УстановитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СубъектУчетаПриИзменении(Элемент)
	
	КвалифицированныйИнвестор = ОпределитьФлагКвалифицированныйИнвестор(Объект.Организация, Объект.СубъектУчета, Объект.Дата);
	
	ОбнулитьНеиспользуемыеРеквизиты();
	
	УстановитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	КвалифицированныйИнвестор = ОпределитьФлагКвалифицированныйИнвестор(Объект.Организация, Объект.СубъектУчета, Объект.Дата);
	
	ОбнулитьНеиспользуемыеРеквизиты();
	
	УстановитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СубъектУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		
		Если НЕ ПроверитьВозможностьВыбораСДУ(ВыбранноеЗначение) Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"В качестве Субъекта аналитики допустим выбор только СДУ со следующими видами договора:
				|'Индивидуальный инвестиционный счет',
				|'Управление активами юридического лица'
				|'Управление активами физического лица'
				|'Управление активами саморегулируемых организаций',
				|'Управление резервами страховых компаний',
				|'Управление собственными средствами пенсионных фондов',
				|'Управление имуществом страховых компаний'.",
				ЭтотОбъект,
				"СубъектУчета");
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаИнвестиционногоГоризонтаПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.СубъектУчета) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда 
		ДатаРасторженияДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СубъектУчета, "ДатаРасторжения");
		Если ЗначениеЗаполнено(ДатаРасторженияДоговора) И ДатаРасторженияДоговора < Объект.ОкончаниеПериодаИнвестиционногоГоризонта Тогда  
			ТекстВопроса = "Окончание периода инвестиционного горизонта не может быть позже даты расторжения договора " + Формат(ДатаРасторженияДоговора, "ДФ=dd.MM.yyyy") + ". Установить дату расторжения как дату окончания инвестиционного горизонта?";
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 30, КодВозвратаДиалога.ОК, , КодВозвратаДиалога.Ок);     
			Если Ответ = КодВозвратаДиалога.ОК Тогда 
				Объект.ОкончаниеПериодаИнвестиционногоГоризонта = ДатаРасторженияДоговора;    
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаИнвестиционногоГоризонтаПриИзменении(Элемент)   
	
	Если ТипЗнч(Объект.СубъектУчета) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда 		
		ДатаЗаключенияДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СубъектУчета, "ДатаЗаключения");
		Если ДатаЗаключенияДоговора > Объект.НачалоПериодаИнвестиционногоГоризонта Тогда      
			ТекстВопроса = "Начало периода инвестиционного горизонта не может быть раньше даты начала договора " + Формат(ДатаЗаключенияДоговора, "ДФ=dd.MM.yyyy") + ". Установить дату заключения договора как дату начала инвестиционного горизонта?";
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 30, КодВозвратаДиалога.ОК, , КодВозвратаДиалога.Ок);     
			Если Ответ = КодВозвратаДиалога.ОК Тогда
				Объект.НачалоПериодаИнвестиционногоГоризонта = ДатаЗаключенияДоговора;
			КонецЕсли;	
		КонецЕсли;	  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтносительныйСрокИнвестиционногоГоризонтаПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.СубъектУчета) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда 
		ДатаРасторженияДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СубъектУчета, "ДатаРасторжения");
				
		Если Объект.ВариантИнвестиционногоГоризонта = ПредопределенноеЗначение("Перечисление.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора") Тогда  
			ДатаЗаключенияДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СубъектУчета, "ДатаЗаключения");
			ДатаОкончанияГоризонта = ДобавитьМесяц(ДатаЗаключенияДоговора, Объект.ОтносительныйСрокИнвестиционногоГоризонта * 12);
		ИначеЕсли Объект.ВариантИнвестиционногоГоризонта = ПредопределенноеЗначение("Перечисление.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыРегистрацииПрофиля") Тогда
			ДатаОкончанияГоризонта = ДобавитьМесяц(Объект.Дата, Объект.ОтносительныйСрокИнвестиционногоГоризонта * 12);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаРасторженияДоговора) И ДатаРасторженияДоговора < ДатаОкончанияГоризонта Тогда   
			ТекстВопроса = "Окончание периода инвестиционного горизонта " + Формат(ДатаОкончанияГоризонта, "ДФ=dd.MM.yyyy") + " не может быть позже даты расторжения договора " + Формат(ДатаРасторженияДоговора, "ДФ=dd.MM.yyyy") + ". Очистить строк инвестиционного горизонта?";
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 30, КодВозвратаДиалога.ОК, , КодВозвратаДиалога.Ок);     
			Если Ответ = КодВозвратаДиалога.ОК Тогда
				Объект.ОтносительныйСрокИнвестиционногоГоризонта = 0;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Форма)
	
	Элементы		= Форма.Элементы;
	ДанныеОбъекта	= Форма.Объект;
	
	СубъектСДУ = ТипЗнч(ДанныеОбъекта.СубъектУчета) = Тип("СправочникСсылка.СчетаДоверительногоУправления");
	
	ВариантГоризонтаИнтервалом = ДанныеОбъекта.ВариантИнвестиционногоГоризонта = ПредопределенноеЗначение("Перечисление.ВариантыИнвестиционногоГоризонта.ИнтервалДат");
	
	Элементы.НачалоПериодаИнвестиционногоГоризонта.Видимость		= ВариантГоризонтаИнтервалом;
	Элементы.ОкончаниеПериодаИнвестиционногоГоризонта.Видимость		= ВариантГоризонтаИнтервалом;
	Элементы.ОтносительныйСрокИнвестиционногоГоризонта.Видимость	= НЕ ВариантГоризонтаИнтервалом;
	
	Элементы.КвалифицированныйИнвестор.Видимость = ЗначениеЗаполнено(ДанныеОбъекта.Организация) И ЗначениеЗаполнено(ДанныеОбъекта.СубъектУчета)
												И СубъектСДУ;
	
	Элементы.ГруппаГоризонтальная.Видимость = СубъектСДУ;
	
	ЭтоФизЛицо = КлиентФизЛицо(ДанныеОбъекта.СубъектУчета, ДанныеОбъекта.Дата);
	
	Элементы.НаличиеОпытаИЗнанийВОбластиИнветисрования.Видимость		= НЕ Форма.КвалифицированныйИнвестор И ЭтоФизЛицо;
	Элементы.ВеличинаУсловногоДохода.Видимость							= НЕ Форма.КвалифицированныйИнвестор И ЭтоФизЛицо;
	Элементы.ВеличинаУсловныхНакоплений.Видимость						= НЕ Форма.КвалифицированныйИнвестор И ЭтоФизЛицо;
	Элементы.ВеличинаУсловногоРасхода.Видимость							= НЕ Форма.КвалифицированныйИнвестор И ЭтоФизЛицо;
	Элементы.ПриемлемыйУровеньРискаВОтносительномВыражении.Видимость	= НЕ Форма.КвалифицированныйИнвестор И ЭтоФизЛицо;
	
	Элементы.ПредельныйДопустимыйРискЗаВесьСрокИнвестирования.Видимость		= НЕ Форма.КвалифицированныйИнвестор И НЕ ЭтоФизЛицо;
	Элементы.РазмерЦелевыхСредств.Видимость									= НЕ Форма.КвалифицированныйИнвестор И НЕ ЭтоФизЛицо;
	Элементы.СоотношениеЧистыхАктивовКОбъемуПередаваемыхСредств.Видимость	= НЕ Форма.КвалифицированныйИнвестор И НЕ ЭтоФизЛицо;
	Элементы.НаличиеСпециалистовИлиПодразделенияИД.Видимость				= НЕ Форма.КвалифицированныйИнвестор И НЕ ЭтоФизЛицо;
	Элементы.НаличиеОперацийСФИЗаПоследнийОтчетныйГод.Видимость				= НЕ Форма.КвалифицированныйИнвестор И НЕ ЭтоФизЛицо;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	КвалифицированныйИнвестор = ОпределитьФлагКвалифицированныйИнвестор(Объект.Организация, Объект.СубъектУчета, Объект.Дата);
	
	УстановитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ОбнулитьНеиспользуемыеРеквизиты()
	
	Если ТипЗнч(Объект.СубъектУчета) = Тип("СправочникСсылка.СчетаДоверительногоУправления")
		И НЕ КвалифицированныйИнвестор Тогда
		
		ЭтоФизЛицо = КлиентФизЛицо(Объект.СубъектУчета, Объект.Дата);
		
		Если НЕ ЭтоФизЛицо Тогда
			Объект.НаличиеОпытаИЗнанийВОбластиИнвестирования		= Неопределено;
			Объект.ВеличинаУсловногоДохода							= Неопределено;
			Объект.ВеличинаУсловногоРасхода							= Неопределено;
			Объект.ВеличинаУсловныхНакоплений						= Неопределено;
			Объект.ПриемлемыйУровеньРискаВОтносительномВыражении	= Неопределено;
		Иначе
			Объект.ПредельныйДопустимыйРискЗаВесьСрокИнвестирования		= Неопределено;
			Объект.РазмерЦелевыхСредств									= Неопределено;
			Объект.СоотношениеЧистыхАктивовКОбъемуПередаваемыхСредств	= Неопределено;
			Объект.НаличиеСпециалистовИлиПодразделенияИД				= Неопределено;
			Объект.НаличиеОперацийСФИЗаПоследнийОтчетныйГод				= Неопределено;
		КонецЕсли;
		
	Иначе
		Если НЕ КвалифицированныйИнвестор Тогда
			Объект.СуммаПередаваемыхВДУСредств = Неопределено;
		КонецЕсли;
		
		Объект.НаличиеОпытаИЗнанийВОбластиИнвестирования			= Неопределено;
		Объект.ВеличинаУсловногоДохода								= Неопределено;
		Объект.ВеличинаУсловногоРасхода								= Неопределено;
		Объект.ВеличинаУсловныхНакоплений							= Неопределено;
		Объект.ПриемлемыйУровеньРискаВОтносительномВыражении		= Неопределено;
		Объект.ПредельныйДопустимыйРискЗаВесьСрокИнвестирования		= Неопределено;
		Объект.РазмерЦелевыхСредств									= Неопределено;
		Объект.СоотношениеЧистыхАктивовКОбъемуПередаваемыхСредств	= Неопределено;
		Объект.НаличиеСпециалистовИлиПодразделенияИД				= Неопределено;
		Объект.НаличиеОперацийСФИЗаПоследнийОтчетныйГод				= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВозможностьВыбораСДУ(СДУ)
	
	Возврат СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет
		ИЛИ СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица
		ИЛИ СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица
		ИЛИ СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций
		ИЛИ СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний
		ИЛИ СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов
		ИЛИ СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний
		ИЛИ СДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов;
	
КонецФункции

&НаСервереБезКонтекста
Функция КлиентФизЛицо(СубъектУчета, Период)
	
	Если НЕ ЗначениеЗаполнено(СубъектУчета)
		ИЛИ ТипЗнч(СубъектУчета) <> Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо) КАК ЭтоФизЛицо
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СубъектУчета) КАК КлиентыДоверительногоУправленияСрезПоследних";
	
	Запрос.УстановитьПараметр("СубъектУчета", СубъектУчета);
	
	Если ЗначениеЗаполнено(Период) Тогда
		Запрос.УстановитьПараметр("Период", Период);
	Иначе
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭтоФизЛицо;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьФлагКвалифицированныйИнвестор(Организация, СубъектУчета, Период)
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ НЕ ЗначениеЗаполнено(СубъектУчета)
		ИЛИ ТипЗнч(СубъектУчета) <> Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("СДУ",			СубъектУчета);
	
	Если ЗначениеЗаполнено(Период) Тогда
		Запрос.УстановитьПараметр("Период", Период);
	Иначе
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	               |ПОМЕСТИТЬ _ЮрФизЛицо
	               |ИЗ
	               |	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СДУ) КАК КлиентыДоверительногоУправленияСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КвалифицированныеИнвесторыСрезПоследних.Является
	               |		ИЛИ КвалифицированныеИнвесторыСрезПоследних.ВСилуЗакона КАК КвалифицированныйИнвестор
	               |ИЗ
	               |	РегистрСведений.КвалифицированныеИнвесторы.СрезПоследних(
	               |			&Период,
	               |			ВЫБОР
	               |					КОГДА Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |						ТОГДА Организация = &Организация
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ЮрФизЛицо В
	               |					(ВЫБРАТЬ
	               |						_ЮрФизЛицо.Клиент КАК Клиент
	               |					ИЗ
	               |						_ЮрФизЛицо КАК _ЮрФизЛицо)) КАК КвалифицированныеИнвесторыСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий() И Выборка.КвалифицированныйИнвестор;
	
КонецФункции

#КонецОбласти
